In [8]:
from pandas import DataFrame
data = {'name':['john', 'tim', 'rob'],
       'age': [12, 13, 14],
       'salary': [100, 200, 300]
       }
frame = DataFrame(data)
frame

   name  age  salary
0  john   12     100
1   tim   13     200
2   rob   14     300

In [16]:
# to delete / drop rows :

frame1 = frame.drop([2, 0])
frame1

  name  age  salary
1  tim   13     200

In [17]:
# to delete / drop columns :

frame2 = frame.drop('age', axis=1)     # y axis (i.e. column)
frame2

   name  salary
0  john     100
1   tim     200
2   rob     300